# Selecting Rows

### Introduction

In this lesson, we'll work selecting data across multiple rows.

### Selecting by rows

Let's begin once again by creating our Spark Session.

In [4]:
from pyspark.sql import SparkSession

spark = SparkSession \
    .builder \
    .appName("films") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()

And then we'll load in some data into pandas.

In [28]:
import pandas as pd
movies_df = pd.read_csv('./imdb_movies.csv')

Then let's create our dataframe and take a look.

In [29]:
movies_rdd = spark.createDataFrame(movies_df.astype(str))

In [30]:
movies_rdd.show(3)

+--------------------+---------+---------+-------+----+-----+----------+
|               title|    genre|   budget|runtime|year|month|   revenue|
+--------------------+---------+---------+-------+----+-----+----------+
|              Avatar|   Action|237000000|  162.0|2009|   12|2787965087|
|Pirates of the Ca...|Adventure|300000000|  169.0|2007|    5| 961000000|
|             Spectre|   Action|245000000|  148.0|2015|   10| 880674609|
+--------------------+---------+---------+-------+----+-----+----------+
only showing top 3 rows

Now in Spark, as we know, once thing we cannot do is select a row by the index.  Instead, we can `filter` a row by a unique matching attribute.

For example, below we'll find rows that have the title of `Spectre`.

In [31]:
movies_rdd[movies_rdd['title'] == 'Spectre'].show()

+-------+------+---------+-------+----+-----+---------+
|  title| genre|   budget|runtime|year|month|  revenue|
+-------+------+---------+-------+----+-----+---------+
|Spectre|Action|245000000|  148.0|2015|   10|880674609|
+-------+------+---------+-------+----+-----+---------+

### Breaking it down in pandas

Now understanding why the above works in PySpark is a little complicated to see.  It's actually easier if we briefly switch over to Pandas.

> Pandas is a Python library that also allows us to easily create dataframes.  But unlike Pyspark, it does not work with distributed datasets.

The operation in to select by a row, is quite similar.  Let's take another look at our dataframe in pandas.

In [33]:
movies_df.head()

,title,genre,budget,runtime,year,month,revenue
0,Avatar,Action,237000000,162.0,2009,12,2787965087
1,Pirates of the Caribbean: At World's End,Adventure,300000000,169.0,2007,5,961000000
2,Spectre,Action,245000000,148.0,2015,10,880674609
3,The Dark Knight Rises,Action,250000000,165.0,2012,7,1084939099
4,John Carter,Action,260000000,132.0,2012,3,284139100

And then we select the rows whose title is `Spectre`.

In [36]:
movies_df[movies_df['title'] == 'Spectre']

     title   genre     budget  runtime  year  month    revenue
2  Spectre  Action  245000000    148.0  2015     10  880674609

So we can see that this is essentially the same way that we select by row in Pyspark.

```python
movies_rdd[movies_rdd['title'] == 'Spectre'].show()
```

Ok, now let's explain why the pandas statement `movies_df[movies_df['title'] == 'Spectre']`.  The key is understanding the part inside of the square brackets.

In [40]:
movies_df['title'] == 'Spectre'

0       False
1       False
2        True
3       False
4       False
        ...
1995    False
1996    False
1997    False
1998    False
1999    False
Name: title, Length: 2000, dtype: bool

Notice that this returns a column of `True` or `False` values.  And these values are based on whether that row's title equals `Spectre`.  So this is why only the third record returns True.

Then we pass this column of True or False values to the dataframe, and for each row where column's entry is True, we display that row.

In [44]:
movies_df[movies_df['title'] == 'Spectre']

     title   genre     budget  runtime  year  month    revenue
2  Spectre  Action  245000000    148.0  2015     10  880674609

So we can imagine the above as passing `False, False, True, False` to the dataframe, to only display the first row above.

In [47]:
bool_values = [False, False, True, False]

movies_df[:4][bool_values]

     title   genre     budget  runtime  year  month    revenue
2  Spectre  Action  245000000    148.0  2015     10  880674609

### Moving to Pyspark

So selecting rows in Pyspark essentially works the same way.  We start with our dataframe.

In [49]:
movies_rdd.show(3)

+--------------------+---------+---------+-------+----+-----+----------+
|               title|    genre|   budget|runtime|year|month|   revenue|
+--------------------+---------+---------+-------+----+-----+----------+
|              Avatar|   Action|237000000|  162.0|2009|   12|2787965087|
|Pirates of the Ca...|Adventure|300000000|  169.0|2007|    5| 961000000|
|             Spectre|   Action|245000000|  148.0|2015|   10| 880674609|
+--------------------+---------+---------+-------+----+-----+----------+
only showing top 3 rows

And then we can filter for rows where the title is Spectre with the following.

In [50]:
movies_rdd[movies_rdd['title'] == 'Spectre'].show()

+-------+------+---------+-------+----+-----+---------+
|  title| genre|   budget|runtime|year|month|  revenue|
+-------+------+---------+-------+----+-----+---------+
|Spectre|Action|245000000|  148.0|2015|   10|880674609|
+-------+------+---------+-------+----+-----+---------+

Where we can imagine the middle brackets as returning True or False values for each row of the dataframe.

In [20]:
movies_df['index'] == 1

Column<'(index = 1)'>

### Summary

In this lesson, we learned how to select certain rows in a Pyspark dataframe.  As we saw, we do so with something like the following:

In [51]:
movies_rdd[movies_rdd['title'] == 'Spectre'].show()

+-------+------+---------+-------+----+-----+---------+
|  title| genre|   budget|runtime|year|month|  revenue|
+-------+------+---------+-------+----+-----+---------+
|Spectre|Action|245000000|  148.0|2015|   10|880674609|
+-------+------+---------+-------+----+-----+---------+

And the key part is understanding the component in between the brackets.

In [52]:
movies_rdd['title'] == 'Spectre'

Column<'(title = Spectre)'>

We can imagine the code above returning a True or False value based on whether the value in the index column equals 1.  

And then we pass this statement into our dataframe to return the records where the above statement returns True.

In [54]:
movies_rdd[movies_rdd['title'] == 'Spectre'].show()

+-------+------+---------+-------+----+-----+---------+
|  title| genre|   budget|runtime|year|month|  revenue|
+-------+------+---------+-------+----+-----+---------+
|Spectre|Action|245000000|  148.0|2015|   10|880674609|
+-------+------+---------+-------+----+-----+---------+

### Resources

[Gitbook Understanding Spark](https://mallikarjuna_g.gitbooks.io/spark/content/spark-overview.html)